CSI API ETABS v1

# cSapModelPropPointSpring Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropPointSpring PropPointSpring { get; }

    ReadOnly Property PropPointSpring As cPropPointSpring
    	Get

    Dim instance As cSapModel
    Dim value As cPropPointSpring

    value = instance.PropPointSpring

    property cPropPointSpring^ PropPointSpring {
    	cPropPointSpring^ get ();
    }

    abstract PropPointSpring : cPropPointSpring with get

#### Property Value

Type: cPropPointSpring

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com